import math

def area(r):
    """
    Принимает на вход число r, возвращает площадь круга с радиусом r.

    Параметры:
    r (float): Радиус круга.

    Пример вызова:
    area(5)  # Вернет площадь круга с радиусом 5

    Возвращает:
    float: Площадь круга.
    """
    return math.pi * r * r

def perimeter(r):
    """
    Принимает на вход число r, возвращает периметр (длину окружности) круга с радиусом r.

    Параметры:
    r (float): Радиус круга.

    Пример вызова:
    perimeter(5)  # Вернет периметр круга с радиусом 5

    Возвращает:
    float: Периметр круга.
    """
    return 2 * math.pi * r
