
def area(a):
    """Принимает на вход число a, возвращает площадь квадрата со стороной a.

    Параметры:
    a (float): сторона квадрата.

    Пример вызова:
    area(2) #вернет площадь квадрата со стороной a

    Возвращает:
    float: площадь квадрата.
    """
    return a * a


def perimeter(a):
    """Принимает на вход число a, возвращает периметр квадрата со стороной a.

    Параметры:
    a (float): сторона квадрата.

    Пример вызова:
    perimeter(2) #вернет периметр квадрата со стороной 2

    Возвращает:
    float: периметр квадрата.
    """
    return 4 * a
