import math

def area(a, b, c):
    """
    Вычисляет площадь треугольника по формуле Герона.

    Параметры:
    a (float): Длина первой стороны треугольника.
    b (float): Длина второй стороны треугольника.
    c (float): Длина третьей стороны треугольника.

    Пример вызова:
    area(3, 4, 5)  # Вернет площадь треугольника со сторонами 3, 4 и 5  (6.0).

    Возвращает:
    float: Площадь треугольника.
    """
    s = (a + b + c) / 2  # Полупериметр
    return math.sqrt(s * (s - a) * (s - b) * (s - c))  # Площадь по формуле Герона


def perimeter(a, b, c):
    """
    Вычисляет периметр треугольника.

    Параметры:
    a (float): Длина первой стороны треугольника.
    b (float): Длина второй стороны треугольника.
    c (float): Длина третьей стороны треугольника.

    Пример вызова:
    perimeter(3, 4, 5)  # Вернет периметр треугольника со сторонами 3, 4 и 5 (12).

    Возвращает:
    float: Периметр треугольника.
    """
    return a + b + c
